# editing
brew 'neovim'
cask 'code'
brew 'lazygit'
brew 'ripgrep'
brew 'fzf'
brew 'jq'
brew 'fd'

# languages
brew 'n'
brew 'pyenv'
brew 'pipx'
brew 'go'
brew 'golangci-lint'
brew 'stylua'

# services
cask 'google-cloud-sdk'

cask 'kitty'
cask 'authy'
cask 'rectangle'
cask 'messenger'
cask 'docker'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack-nerd-font'

cask 'logitech-options'
cask 'obsidian'
cask 'mactex'
