# editing
cask 'kitty'
brew 'neovim'
cask 'visual-studio-code'
brew 'lazygit'
brew 'ripgrep'
brew 'fzf'
brew 'jq'
brew 'fd'

# language ecosystems
brew 'pyenv'
brew 'node'
brew 'go'
brew 'golangci-lint'
brew 'stylua'

# services
cask 'google-cloud-sdk'
cask 'docker'
cask 'chatgpt'

# utilities
cask 'stats'
cask 'authy'
cask 'rectangle'
cask 'messenger'
brew 'graphviz'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack-nerd-font'

cask 'logitech-options'

brew 'pgcli'
brew 'duckdb'
