brew 'neovim'
brew 'lazygit'
brew 'ripgrep'
brew 'stylua'
brew 'fzf'
brew 'glow'
brew 'jq'
brew 'fd'
brew 'n'
brew 'less'

brew 'pyenv'
brew 'go'
brew 'golangci-lint'

cask 'kitty'
cask 'slack'
cask 'authy'
cask 'rectangle'
cask 'messenger'
cask 'docker'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack-nerd-font'

tap 'homebrew/homebrew-cask-drivers'
cask 'logitech-options'
